Tester/src/Catalogs/Exchange/Exchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Exchange</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DateLoad</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateUnload</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMailUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeTransport</name>
    <type>
      <types>EnumRef.ExchangeTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>FileMessage</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MaximumErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Node</name>
    <type>
      <types>ExchangePlanRef.Full</types>
    </type>
  </attributes>
  <attributes>
    <name>NumbersOfErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PassiveModeFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PasswordEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.ExchangePeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPUnLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortIncoming</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortOutgoing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PrefixFileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Protocol</name>
    <type>
      <types>EnumRef.Protocols</types>
    </type>
  </attributes>
  <attributes>
    <name>SendedEMailError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SendEMailErrors</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerIncoming</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerOutgoing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerTimeOut</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Update</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAutomatic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UserEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseSSLIncoming</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSSLOutgoing</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseStandartFTPClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Receivers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/Exchange/Module.bsl
Procedure RunExchange ( Load = true, Unload = true ) export
	
	activeJobs = ScheduledJobs.GetScheduledJobs ( new Structure ( "Key", Metadata.ScheduledJobs.Exchange.Key ) );
	if ( activeJobs.Count () > 1 ) then
		Output.AlreadyRunExchangeFull ();
		return;
	endif;
	p = new Structure ();
	p.Insert ( "Node", Catalogs.Exchange.EmptyRef () );
	p.Insert ( "Update", false );
	p.Insert ( "IsJob", true );
	p.Insert ( "ID", "" );
	DataProcessors.ExchangeData.Load ( p );
	if ( p.Update ) then
		DataProcessors.Update.Run ( p.ID );
	else
		DataProcessors.ExchangeData.Unload ( p );
	endif;
	
EndProcedure

Procedure SendEMail ( Data ) export 
	
	if ( Data.TableReceivers <> undefined ) then
		mail = new InternetMail ();
		try
			mail.Logon ( Data.Profile, Data.Protocol );	
		except
			Output.ErrorLogonInternetMail ( new Structure ( "ErrorDescription", ErrorDescription () ) );
			return;
		endtry;
		sendReport ( Data, mail );
	endif; 
	mail.Logoff ();
	
EndProcedure

Procedure sendReport ( Data, Mail )	
	
	for each receiver in Data.TableReceivers do
		msg = getEmailMessage ( Data.Profile.SMTPUser, receiver, Data.Theme, Data.TextMessage );
		msg.To.Add ( receiver.EmailAddress );
	enddo;
	recipients = mail.Send ( msg );
	if ( Recipients.Count () = 0 ) then
		return;
	else
		checkRecipients ( recipients ); 	
	endif;
			
EndProcedure
	
Procedure checkRecipients ( Recipients )
	
	for each item in Recipients do
		p = new Structure ();
		p.Insert ( "EMailUnLoad", item.Key );
		p.Insert ( "Error", item.Value ); 
		Output.IncorrectReportRecipients ();
	enddo;
	
EndProcedure 

Function getEmailMessage ( User, DataReceiver, Theme, TextMessage ) export
	
	msg = new InternetMailMessage ();
	msg.From = User;
	msg.Subject = Theme;
	msg.SenderName = User;
	if ( ValueIsFilled ( TextMessage ) ) then
		msg.Texts.Add ( TextMessage, InternetMailTextType.HTML );
	endif;
	return msg;
	
EndFunction

Procedure WSRead ( Params ) export
	
	proxy = getProxy ( Params );
	Output.ConnectToWS ();	
	error = proxy.Begin ( Params.Node, Params.Description, Params.Incoming, Params.Outgoing );
	Params.Result = not error;
	if ( error ) then
		return;
	endif;
	Output.ReadWS ();
	data = proxy.Read ( Params.Node );
	binary = data.Get ();
	binary.Write ( Params.Path );
	
EndProcedure

Procedure WSWrite ( Params ) export 	
	
	proxy = getProxy ( Params );
	Output.ConnectToWS ();
	error = proxy.Begin ( Params.Node, Params.Description, Params.Incoming, Params.Outgoing );
	Params.Result = not error;
	if ( error ) then
		return;
	endif;
	Output.WriteWS ();
	binData = new BinaryData ( Params.Path );
	data = new ValueStorage ( binData, new Deflation ( 9 ) );
	proxy.Write ( Params.Node, data, Params.FileExchange );
	
EndProcedure

Function getProxy ( Params )
	
	address = Params.WebService + "/ws/wsExchange.1cws?wsdl";
	definitions = new WSDefinitions ( address, Params.User, Params.Password, , 30 );
	uri = wsExchange ();
	proxy = new WSProxy ( definitions, URI, "Exchange", "ExchangeSoap", , 30 );
	proxy.User = Params.User;
	proxy.Password = Params.Password;
	return proxy;
	
EndFunction

Function wsExchange ()
    
    return "http://localhost/wsExchange";
    
EndFunction

Function CreateTempDir ( PostFix ) export
	
	folder = new File ( TempFilesDir () + PostFix );
	if ( folder.Exist () ) then
		EraseFile ( folder.FullName );
	endif;
	CreateDirectory ( folder.FullName );
	return ( folder.FullName + GetPathSeparator () );
	
EndFunction

Function GetTempDir ( ID ) export
	
	postfix = "ExchangeDataTemp_" + ID;
	f = new File ( TempFilesDir () + postfix );
	if ( f.Exist () ) then
		return ( f.FullName + GetPathSeparator () );
	else
		return ""; 
	endif;
	
EndFunction 

Procedure DeleteTempDirectory ( TempDirectory ) export
	
	EraseFile ( Mid ( TempDirectory, 1, ( StrLen ( TempDirectory ) - 1 ) ) );	
	
EndProcedure

Procedure EraseFile ( File ) export
	
	try
		DeleteFiles ( File );
	except
		Output.FileDeletionError ( new Structure ( "File, Error", File, ErrorDescription () ) );	
	endtry;
	
EndProcedure

Procedure RecordChanges ( Ref ) export
	
	SetPrivilegedMode ( true );
	registerScenario ( Ref );
	
EndProcedure

Procedure registerScenario ( Scenario )
	
	nodes = getNodes ( Scenario );
	ExchangePlans.RecordChanges ( nodes, Scenario );
	
EndProcedure

Function getNodes ( Ref )
	
	s = "
	|select
	|	Ref as Node
	|from
	|	ExchangePlan.Full
	|where
	|	not ThisNode
	|	and not DeletionMark
	|"; 
	q = new Query ( s );
	result = q.Execute ();
	return result.Unload ().UnloadColumn ( "Node" ); 
	
EndFunction

Procedure RereadData () export 
	
	Output.StartReReadData ();
	data = getData ();
	if ( data = undefined ) then
		return;
	endif;
	if ( data.FileMessage <> "" ) then
		id = "";
		try
			xml = new File ( data.FileMessage );
			id = Left ( Right ( xml.Path, 37 ), 36 );
		except
			return;
		endtry;
		Output.ExchangeLoadingAgain ( new Structure ( "Node, ID", data.Node, id ) );
		runRereadData ( data, id );
	endif;
	Output.CloseCurrentSession ();
	Connections.DisconnectMe ();
	
EndProcedure

Function getData ()

	s = "
	|select top 1 
	|	Ref as Ref, 
	|	Node as Node,
	|	FileMessage as FileMessage
	|from 
	|	Catalog.Exchange
	|where
	|	Node = &MasterNode
	|";
	query = new Query ( s );
	query.SetParameter ( "MasterNode", ExchangePlans.MasterNode () );
	result = query.Execute ();
	if ( result.IsEmpty () ) then
		return undefined;
	else
		selection = result.Select ();
		selection.Next ();
		return selection;
	endif;
	
EndFunction 

Procedure runRereadData ( Data, ID )
	
	p = new Structure ();
	p.Insert ( "Node", data.Ref );
	p.Insert ( "IsJob", true );
	p.Insert ( "Update", true );
	p.Insert ( "ID", ID );
	Output.ReReadLoad ();
	DataProcessors.ExchangeData.Load ( p );
	Output.ReReadUnLoad ();
	DataProcessors.ExchangeData.UnLoad ( p );
	
EndProcedure

Procedure WriteLog ( Text ) export
	
	WriteLogEvent ( "Exchange", EventLogLevel.Information, , , Text );
	
EndProcedure
